app/controllers/v1/laborers_controller.rb

  def index
    render json: Laborer.all.to_json
---
SELECT "laborers".* FROM "laborers"

  def show
    laborer = Laborer.find_by(id: params[:id])
---
SELECT "laborers".* FROM "laborers" WHERE "laborers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    laborer = Laborer.new(laborer_params)

    if laborer.save
---
INSERT INTO "laborers" ("name", "skill", "city", "country", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    laborer = Laborer.find_by(id: params[:id])

    if laborer.nil?
      render status: 404, json: { error: 'Laborer not found' }.to_json
    else
      laborer.destroy
---
SELECT "laborers".* FROM "laborers" WHERE "laborers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "laborers" WHERE "laborers"."id" = $1  [["id", 3]]