app/controllers/v1/reservations_controller.rb

  def index
    render json: Reservation.all.to_json
---
SELECT "reservations".* FROM "reservations"

  def show
    reservation = Reservation.find_by(id: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    reservation = Reservation.new(reservation_params)
    reservation.cost = reservation.laborer.price * reservation.number_days

    if reservation.save
---
INSERT INTO "reservations" ("start_date", "number_days", "cost", "created_at", "updated_at", "user_id", "laborer_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["start_date", "2022-09-07"], ["number_days", 5], ["cost", "450.0"], ["created_at", "2023-06-13 20:15:58.230647"], ["updated_at", "2023-06-13 20:15:58.230647"], ["user_id", 3], ["laborer_id", 2]]

  def destroy
    reservation = Reservation.find_by(id: params[:id])

    if reservation.nil?
      render status: 404, json: { error: 'Reservation not found' }.to_json
    else
      reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 3]]