app/controllers/v1/users_controller.rb

  def destroy
    user = User.find_by(id: params[:id])

    if user.nil?
      render status: 404, json: { error: 'User not found' }.to_json
    else
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]